<?php
/*---Входные данные---*/
$x = 1;
$max = 1000;


////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////Nat_method_1///////////////////////////////////
/*----------------------------------------------------------------------------*/
/*----------------------------- Result - number ------------------------------*/
/*----------------------------------------------------------------------------*/
function Nat_method_1($max){
    $n = 0;
    
    for($i=2;$i<$max;$i++,$j++){
    
        $res_1 = ($j-31)/3+1; 
        $res_2 = (3*$res_1)-$j; 
        $res_3 = (pow(2,$res_2)-$i)%7;
        
        if($res_3 == 0) $n++;
        
    }
    
return $n;
} 

////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////Nat_method_2///////////////////////////////////
/*----------------------------------------------------------------------------*/
/*----------------------------- Result - number ------------------------------*/
/*----------------------------------------------------------------------------*/
function Nat_method_2($max){
    
    for($i=1;$i<$max;$i++){
        
        $res_1 = gmp_pow(2,$i); //Повышенная точность, чтобы не получить кривой результат (степень)
        $res_2 = gmp_sub($res_1,$i); //Повышенная точность, чтобы не получить кривой результат (вычитание)
        $res_3 = gmp_div_r($res_2,7); //Повышенная точность, чтобы не получить кривой результат (остаток от деления)
        
        if(gmp_strval($res_3) == 0) $n++; //Преобразование GMP числа в строку
    }
    
return $n;
} 

////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////Fibonachi/////////////////////////////////////
/*----------------------------------------------------------------------------*/
/*------------------------- Result - (True/False) ----------------------------*/
/*----------------------------------------------------------------------------*/
function Fibonachi($x){
    $y = '1';
    $result = [1, 1];
    $i=2;
  
    while ($y<$x){
        $y = $result[$i-1] + $result[$i-2];
        array_push($result,$y);
        $i++;
    }
    if ($x==$y) $return =  'Это число фибоначи!';
    else $return =  'Это не число фибоначи!';
    
return $return;
}


/*------Вывод------*/
print_r(Fibonachi($x));

echo('<br>');

print_r(Nat_method_1($max));

echo('<br>');

print_r(Nat_method_2($max));
?>